CRUD-general-purpose/2022/ranking_batch-0_mongodb-500-vanilla-ce-small-medium-alibaba-2022_0_RhcOWLHm/0_load.txt
bin/ycsb load mongodb -s -jvm-args=-XX:MaxRAMPercentage=85.0  -p mongodb.url=mongodb://benchant:benchANT2022@192.168.0.207:27017/admin -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3
/usr/java/bin/java -XX:MaxRAMPercentage=85.0 -cp /binary/ycsb/mongodb-binding/conf:/binary/ycsb/conf:/binary/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/binary/ycsb/lib/HdrHistogram-2.1.4.jar:/binary/ycsb/lib/core-0.17.0.jar:/binary/ycsb/lib/jackson-core-asl-1.9.4.jar:/binary/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/binary/ycsb/mongodb-binding/lib/slf4j-api-1.7.25.jar:/binary/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/binary/ycsb/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/binary/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/binary/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/binary/ycsb/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/binary/ycsb/mongodb-binding/lib/mongodb-binding-0.17.0.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -p mongodb.url=mongodb://benchant:benchANT2022@192.168.0.207:27017/admin -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
Command line: -db site.ycsb.db.MongoDbClient -s -p mongodb.url=mongodb://benchant:benchANT2022@192.168.0.207:27017/admin -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
YCSB Client 0.17.0

Loading workload...
Starting test.
2022-07-08 07:43:07:994 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://benchant:benchANT2022@192.168.0.207:27017/admin
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2022-07-08 07:43:17:980 10 sec: 168291 operations; 16829.1 current ops/sec; est completion in 4 minutes [INSERT: Count=168309, Max=454911, Min=1173, Avg=5773.53, 90=7483, 99=10311, 99.9=49471, 99.99=442111] 
2022-07-08 07:43:27:980 20 sec: 337166 operations; 16887.5 current ops/sec; est completion in 4 minutes [INSERT: Count=168866, Max=468479, Min=1292, Avg=5919.79, 90=7543, 99=10567, 99.9=145279, 99.99=464639] 
2022-07-08 07:43:37:980 30 sec: 516521 operations; 17935.5 current ops/sec; est completion in 4 minutes [INSERT: Count=179354, Max=57183, Min=1397, Avg=5574.46, 90=7579, 99=10287, 99.9=23103, 99.99=55551] 
2022-07-08 07:43:47:980 40 sec: 671257 operations; 15473.6 current ops/sec; est completion in 4 minutes [INSERT: Count=154735, Max=722431, Min=1246, Avg=6461.13, 90=7695, 99=11159, 99.9=176127, 99.99=719871] 
2022-07-08 07:43:57:980 50 sec: 850777 operations; 17952 current ops/sec; est completion in 4 minutes [INSERT: Count=179513, Max=18239, Min=1201, Avg=5568.3, 90=7603, 99=10103, 99.9=12303, 99.99=14535] 
2022-07-08 07:44:07:980 60 sec: 1028640 operations; 17786.3 current ops/sec; est completion in 3 minutes [INSERT: Count=177866, Max=27951, Min=1211, Avg=5621.92, 90=7699, 99=10183, 99.9=13279, 99.99=25839] 
2022-07-08 07:44:17:980 70 sec: 1200029 operations; 17138.9 current ops/sec; est completion in 3 minutes [INSERT: Count=171386, Max=156927, Min=1391, Avg=5752.56, 90=7707, 99=10831, 99.9=64031, 99.99=154111] 
2022-07-08 07:44:27:980 80 sec: 1289604 operations; 8957.5 current ops/sec; est completion in 3 minutes [INSERT: Count=89587, Max=1374207, Min=1250, Avg=11315.49, 90=7579, 99=12239, 99.9=1360895, 99.99=1372159] 
2022-07-08 07:44:37:980 90 sec: 1468545 operations; 17894.1 current ops/sec; est completion in 3 minutes [INSERT: Count=178935, Max=20975, Min=1142, Avg=5586.72, 90=7639, 99=10367, 99.9=13767, 99.99=18175] 
2022-07-08 07:44:47:980 100 sec: 1645624 operations; 17707.9 current ops/sec; est completion in 3 minutes [INSERT: Count=177073, Max=140799, Min=1142, Avg=5646.79, 90=7671, 99=10255, 99.9=14423, 99.99=137855] 
2022-07-08 07:44:57:980 110 sec: 1794836 operations; 14921.2 current ops/sec; est completion in 3 minutes [INSERT: Count=149213, Max=1085439, Min=1364, Avg=6700.79, 90=7675, 99=13503, 99.9=315647, 99.99=1084415] 
2022-07-08 07:45:07:980 120 sec: 1943803 operations; 14896.7 current ops/sec; est completion in 3 minutes [INSERT: Count=148979, Max=822271, Min=1275, Avg=6710.97, 90=7751, 99=11695, 99.9=466431, 99.99=819711] 
2022-07-08 07:45:17:980 130 sec: 2119671 operations; 17586.8 current ops/sec; est completion in 2 minutes [INSERT: Count=175856, Max=52031, Min=1205, Avg=5685.3, 90=7699, 99=10895, 99.9=35039, 99.99=49951] 
2022-07-08 07:45:27:980 140 sec: 2229219 operations; 10954.8 current ops/sec; est completion in 2 minutes [INSERT: Count=109547, Max=1619967, Min=1601, Avg=8752.04, 90=7891, 99=11719, 99.9=902143, 99.99=1616895] 
2022-07-08 07:45:37:980 150 sec: 2401419 operations; 17220 current ops/sec; est completion in 2 minutes [INSERT: Count=172208, Max=813567, Min=1158, Avg=6044.67, 90=7683, 99=10831, 99.9=76671, 99.99=541183] 
2022-07-08 07:45:47:980 160 sec: 2578148 operations; 17672.9 current ops/sec; est completion in 2 minutes [INSERT: Count=176721, Max=67007, Min=1258, Avg=5656.83, 90=7747, 99=10727, 99.9=20511, 99.99=63551] 
2022-07-08 07:45:57:980 170 sec: 2753111 operations; 17496.3 current ops/sec; est completion in 2 minutes [INSERT: Count=174964, Max=87039, Min=1043, Avg=5714.87, 90=7755, 99=10639, 99.9=47359, 99.99=84671] 
2022-07-08 07:46:07:980 180 sec: 2902797 operations; 14968.6 current ops/sec; est completion in 2 minutes [INSERT: Count=149693, Max=1182719, Min=1393, Avg=6679.39, 90=7859, 99=11119, 99.9=204799, 99.99=1180671] 
2022-07-08 07:46:17:980 190 sec: 3051176 operations; 14837.9 current ops/sec; est completion in 2 minutes [INSERT: Count=148375, Max=1085439, Min=1685, Avg=6737.98, 90=7763, 99=11199, 99.9=509183, 99.99=1081343] 
2022-07-08 07:46:27:980 200 sec: 3224405 operations; 17322.9 current ops/sec; est completion in 1 minute [INSERT: Count=173232, Max=129663, Min=1111, Avg=5771.39, 90=7823, 99=11167, 99.9=72063, 99.99=125759] 
2022-07-08 07:46:37:980 210 sec: 3344191 operations; 11978.6 current ops/sec; est completion in 1 minute [INSERT: Count=119783, Max=981503, Min=1488, Avg=8347.05, 90=7855, 99=13167, 99.9=797183, 99.99=979967] 
2022-07-08 07:46:47:980 220 sec: 3516980 operations; 17278.9 current ops/sec; est completion in 1 minute [INSERT: Count=172792, Max=118719, Min=1213, Avg=5786.29, 90=7811, 99=10767, 99.9=58847, 99.99=117567] 
2022-07-08 07:46:57:980 230 sec: 3691793 operations; 17481.3 current ops/sec; est completion in 1 minute [INSERT: Count=174815, Max=127423, Min=1229, Avg=5718.98, 90=7771, 99=10887, 99.9=37855, 99.99=121343] 
2022-07-08 07:47:07:981 240 sec: 3854320 operations; 16252.7 current ops/sec; est completion in 1 minute [INSERT: Count=162518, Max=211327, Min=1145, Avg=5948.72, 90=7815, 99=11063, 99.9=140671, 99.99=209535] 
2022-07-08 07:47:17:980 250 sec: 4007638 operations; 15331.8 current ops/sec; est completion in 1 minute [INSERT: Count=153319, Max=899583, Min=938, Avg=6736.59, 90=7859, 99=13127, 99.9=232447, 99.99=896511] 
2022-07-08 07:47:27:980 260 sec: 4150608 operations; 14297 current ops/sec; est completion in 54 seconds [INSERT: Count=142974, Max=1210367, Min=1270, Avg=6993.54, 90=7779, 99=11063, 99.9=710655, 99.99=1208319] 
2022-07-08 07:47:37:980 270 sec: 4286024 operations; 13541.6 current ops/sec; est completion in 45 seconds [INSERT: Count=135413, Max=1135615, Min=865, Avg=7383.37, 90=7931, 99=11271, 99.9=1039359, 99.99=1131519] 
2022-07-08 07:47:47:980 280 sec: 4460920 operations; 17489.6 current ops/sec; est completion in 34 seconds [INSERT: Count=174902, Max=118079, Min=1107, Avg=5716.58, 90=7723, 99=10511, 99.9=31759, 99.99=112639] 
2022-07-08 07:47:57:980 290 sec: 4631475 operations; 17055.5 current ops/sec; est completion in 24 seconds [INSERT: Count=170557, Max=221055, Min=1197, Avg=5861.67, 90=7759, 99=11199, 99.9=101823, 99.99=219775] 
2022-07-08 07:48:07:980 300 sec: 4805974 operations; 17449.9 current ops/sec; est completion in 13 seconds [INSERT: Count=174492, Max=79231, Min=1295, Avg=5729.74, 90=7859, 99=11295, 99.9=35647, 99.99=76287] 
2022-07-08 07:48:17:980 310 sec: 4963053 operations; 15707.9 current ops/sec; est completion in 3 second [INSERT: Count=157076, Max=889343, Min=1163, Avg=6141.15, 90=7883, 99=11751, 99.9=44159, 99.99=888319] 
2022-07-08 07:48:21:209 313 sec: 5000000 operations; 11442.24 current ops/sec; [CLEANUP: Count=100, Max=3809, Min=0, Avg=38.39, 90=1, 99=5, 99.9=3809, 99.99=3809] [INSERT: Count=36947, Max=1065983, Min=650, Avg=8431.57, 90=7359, 99=36095, 99.9=1062911, 99.99=1064959] 
[OVERALL], RunTime(ms), 313229
[OVERALL], Throughput(ops/sec), 15962.762068646261
[TOTAL_GCS_PS_Scavenge], Count, 2301
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 2035
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.6496844161939029
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 2301
[TOTAL_GC_TIME], Time(ms), 2035
[TOTAL_GC_TIME_%], Time(%), 0.6496844161939029
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 38.39
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 3809
[CLEANUP], 95thPercentileLatency(us), 1
[CLEANUP], 99thPercentileLatency(us), 5
[INSERT], Operations, 5000000
[INSERT], AverageLatency(us), 6248.4087576
[INSERT], MinLatency(us), 650
[INSERT], MaxLatency(us), 1619967
[INSERT], 95thPercentileLatency(us), 8663
[INSERT], 99thPercentileLatency(us), 10895
[INSERT], Return=OK, 5000000